# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-fonts'

# Brews
brew 'antibody'
brew 'bat'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'go'
brew 'httpie'
brew 'mas'
brew 'python'
brew 'ripgrep'
brew 'starship'
brew 'svn' # required for some cask fonts: https://github.com/Homebrew/homebrew-cask/issues/80695
brew 'tree'
brew 'watchman' 

# Casks 
cask 'brave-browser'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'framer'
cask 'firefox-developer-edition'
cask 'google-chrome'
cask 'iina'
cask 'insomnia'
cask 'iterm2'
cask 'kap'
cask 'omnidisksweeper'
cask 'microsoft-edge'
cask 'notion'
cask 'nvidia-geforce-now'
cask 'opera'
cask 'origin'
cask 'postman'
cask 'qbittorrent'
cask 'signal'
cask 'skype'
cask 'slack'
cask 'steam'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'zoom'

# Quicklook plugin Casks: https://github.com/sindresorhus/quick-look-plugins
cask 'qlcolorcode' # Preview source code files with syntax highlighting
cask 'qlimagesize' # Display image size and resolution
cask 'qlmarkdown' # Preview Markdown files
cask 'qlstephen' # Preview plain text files without a file extension. Example: README, CHANGELOG, etc.
cask 'qlprettypatch' # Preview .patch files
cask 'quicklook-csv' # Preview CSV files
cask 'quicklook-json' # Preview JSON files
cask 'suspicious-package' # Preview the contents of a standard Apple installer package
cask 'webpquicklook' # Preview WebP images

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'

# Mac App Store
mas 'Be Focused Pro', id: 961632517
mas 'Bitwarden', id: 1352778147
mas 'Clockify Desktop', id: 1364502317
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541