# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-fonts'
tap 'romkatv/powerlevel10k'

# Brews
brew 'bat'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'httpie'
brew 'mackup'
brew 'mas'
brew 'powerlevel10k'
brew 'ripgrep'
brew 'stripe'
brew 'tree'
brew 'watchman' 

# Casks 
cask 'alfred'
cask 'dash'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'firefox-nightly'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'iina'
cask 'iterm2'
cask 'kap'
cask 'omnidisksweeper'
cask 'opera'
cask 'origin'
cask 'postman'
cask 'qbittorrent'
cask 'sip'
cask 'skype'
cask 'slack'
cask 'steam'
cask 'suspicious-package'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'zoomus'

# Quicklook Casks
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'
cask 'webpquicklook'
cask 'quicklook-json'
cask 'qlvideo'

# Fonts
# cask 'font-lato'
# cask 'font-open-sans'
# cask 'font-roboto'

# Mac App Store
mas 'Affinity Designer', id: 824171161
mas 'Affinity Photo', id: 824183456
mas 'Be Focused Pro, id: 961632517
mas 'Clockify Desktop', id: 1364502317
mas 'Numbers, id: 409203825
mas 'Pages', id: 409201541
mas 'Trello', id: 1278508951
# mas "Xcode", id: 497799835