# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/cask-fonts'

# Brews
brew 'azure-cli'
brew 'bat'
brew 'flyctl'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'go'
brew 'httpie'
brew 'mas'
brew 'python'
brew 'ripgrep'
brew 'starship'
brew 'svn' # required for fonts
brew 'trash-cli'
brew 'tree'
brew 'watchman' 

# Casks
cask 'affinity-designer'
cask 'affinity-photo'
cask 'blender'
cask 'discord'
cask 'docker'
cask 'fig'
cask 'figma'
cask 'firefox-developer-edition'
cask 'gog-galaxy'
cask 'google-chrome'
cask 'iina'
cask 'insomnia'
cask 'kap'
cask 'kitty'
cask 'logseq'
cask 'microsoft-teams'
cask 'omnidisksweeper'
cask 'postman'
cask 'qbittorrent'
cask 'raycast'
cask 'slack'
cask 'sketch'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'zoom'

# Quicklook plugin Casks: https://github.com/sindresorhus/quick-look-plugins
cask 'qlcolorcode' # Preview source code files with syntax highlighting
cask 'qlimagesize' # Display image size and resolution
cask 'qlmarkdown' # Preview Markdown files
cask 'qlstephen' # Preview plain text files without a file extension. Example: README, CHANGELOG, etc.
cask 'qlprettypatch' # Preview .patch files
cask 'quicklook-csv' # Preview CSV files
cask 'quicklook-json' # Preview JSON files
cask 'suspicious-package' # Preview the contents of a standard Apple installer package
cask 'webpquicklook' # Preview WebP images

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-inter'

# Mac App Store
mas 'AdGuard para Safari', id: 1440147259
mas 'Be Focused Pro', id: 961632517
mas 'Bitwarden', id: 1352778147
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Xcode', id: 497799835